/**
  ******************************************************************************
  * @文件名     ： watchdog_app.h
  * @作者       ： FelixWu
  * @版本       ： V1.0.0
  * @日期       ： 2019年04月25日
  * @摘要       ： 看门狗
  ******************************************************************************/

/* 定义防止递归包含 ----------------------------------------------------------*/
#ifndef __WATCHDOG_APP_H
#define __WATCHDOG_APP_H


/* 包含的头文件 --------------------------------------------------------------*/
#include "FreeRTOS.h"
#include "task.h"

/* 宏定义 --------------------------------------------------------------------*/
#define WATCHDOG_STACK_SIZE 64
#define WATCHDOG_TASK_PRIORITY 0


/* 变量定义 --------------------------------------------------------------------*/
extern TaskHandle_t WATCHDOG_App_Task_Handler;


/* 函数申明 ------------------------------------------------------------------*/
void WatchDog_App_Init(void);


#endif

/**** Copyright (C)2019 FelixWu. All Rights Reserved **** END OF FILE ****/



