/**
  ******************************************************************************
  * @文件名     ： bsp_timer.h
  * @作者       ： Felix Wu
  * @版本       ： V1.0.0
  * @日期       ： 2018年11月14日
  * @摘要       ： TIM底层头文件
  ******************************************************************************/

/* 定义防止递归包含 ----------------------------------------------------------*/
#ifndef _BSP_TIMER_H
#define _BSP_TIMER_H


/* 包含的头文件 --------------------------------------------------------------*/
#include "stm32f10x.h"


/* 宏定义 --------------------------------------------------------------------*/

void TIM3_Int_Init(u16 arr,u16 psc);

extern volatile unsigned long long FreeRTOSRunTimeTicks;
void ConfigureTimeForRunTimeStats(void);

/* 函数申明 ------------------------------------------------------------------*/

#endif /* _BSP_TIMER_H */

/**** Copyright (C)2018 Felix Wu. All Rights Reserved **** END OF FILE ****/
